<template>
  <div>

    <h1>故事背景</h1>

    <div>
      故事是抒情叙事,有五个小故事

      <br>
      章节： <br>
      一、南风知我意，吹梦到西洲。<br>
      <p>
        在一个普通的乡村中有一男一女，此时他们都是十几岁的年纪。在一次偶然的一次的集会中，男孩踢球无意间球滚到了一个小女孩的脚下,
        小女孩帮忙捡起来了球交到了男孩的手中，男孩一抬头就被这个可爱的女孩给深深的吸引到了。于是在心中暗暗发誓，一定要追到这个女孩。
        此后每次集会男孩都会在集会的时候再一次来和女孩碰面的地方等一天，就是希望可以和女孩说话并且女孩的名字。但是从那一次以后就在也
        没有碰到那个女孩。
        就这样几年过去了，男孩也已经二十岁了，这几年中男孩每一次机会都会去，没有一次落下的，但是始终没有见到女孩，女孩其实是搬家去了几十里外的镇子里，而
        男孩平时也因为学习繁忙，也不会去镇子中，所以就没有机会和女孩碰到，渐渐的男孩也要担起更多的家庭的重担，所以男孩每天都在很努力的学习,
        寒窗苦读十几年 就是为了考上状元，因为这是他的梦想。
        功夫不负有心人，终于在男孩二十一岁的时候，考上了状元，但是需要离家很远，但是再远他也要去，因为只有这样，他们才可以实现梦想，这个是他的唯一
        的一次重要的机会，一定不能失去，所以知道他考上的那一天他非常的开心，正巧那年的每逢五年一度的灯会，于是在灯会的那天，他和他的小伙伴们就去镇子上的灯会
        去游玩，这一年去灯会的人比往年要来的多，他和他的小伙伴们要坐船去河的对岸去看灯会。可是这一艘已经满了，男孩子没办法，就必须等下一趟船。
        下一趟船他上船了，在船上他选了一个人不多的地方待在那里，突然发现旁边的女孩很熟悉，她偷偷的看了半天，突然发现这个女孩就是十几年前那天帮他捡球的
        那个女孩，但是女孩应该没有认出来他，他想和她打招呼，想认识她，但是话到了嘴边却停住了。
        他沉思了好久，因为他马上就要去远方了，根本来不及让女孩喜欢上自己了，但是她不想失去这个好不容易才见到女孩在并且能和她单独说话的机会。

        男：你也是一个人来看灯会的吗？
        女：啊？嗯嗯是的
        男：哈哈哈今年的灯会非常的热闹啊
        女：是的，听说还有烟火表演呢
        男：是吗？我怎么没有听说呢
        女：哈哈哈哈一会你看了就知道了
        男：我就说为什么今年的人要比之间灯会的人多不少
        女：哈哈哈

        男：你听过一首诗吗？
        女：什么？
        男：南风知我意，吹梦到西洲
        女：没有哎，是什么意思呢
        男：哈哈哈这个只可意不可言传啊
        女：啊这~你给我讲一讲可以吗
        男：哈哈哈那好吧，我给你讲一个故事吧
        女：好呀
        男：从前有一个男孩，他在家乡的一次集会上碰见了一个女孩，看到女孩的第一眼就喜欢上了这个女孩，于是
        他在每次的集会上都会去到和那个女孩第一次相见的地方，想要再次遇到那个女孩，认识那个女孩，可在那次
        之后男孩就再也没见过那个女孩了。
        女：啊？这，那可能是这个女孩子搬家了吧，搬去了比较远的地方
        男：不知道，在这时候男孩就奋发图强学习，终于考上了状元，他真的很开心很开心，于是就去外面游玩，就在
        男孩在一艘游船上的时候，他终于遇到了这个她心心念念的女孩，最终男孩和那个女孩子表白了，而这个女孩子
        也喜欢他，于是他们两个在一起幸福的生活下去了。
        女：哇，真好！！那这个故事和这首诗之间有什么关系呢？
        男：哈哈哈不知道，快看！！烟火表演开始了
        轰轰轰隆隆隆~~~！！！~~~~！！！
        女：哇，真漂亮
        男：我喜欢你，轰隆
        女：什么？？我没有听清楚你说的什么
        男：哈哈我说烟花好漂亮啊
        女：嗯~是的，好漂亮啊

        烟花表演结束以后
        男：很高兴今天能和你聊天，真的很开心
        女：哈哈哈我也是
        男：有缘再见！
        女：嗯有缘再见。

        男孩女孩就此分别了。
        再回到男孩女孩几岁的时候，在一天男孩和他的小伙伴们在外面玩，突然碰见有几个男孩在欺负一个女孩子，在骂那个女孩，
        男孩二话不说就叫上他的伙伴和那几个男孩扭打在了一起，最后男孩子和他的伙伴把那几个欺负人的男孩打跑了，然后对女孩说，
        以后谁敢再欺负你，我来保护你！！

        结束~~

      </p>

      <br>
      二、红豆生南国，春来发几枝。（怀念友人）<br>

      几个（4个）男孩，从小就是好朋友，突然有一天怪物袭击了他们的村子，村子在西方边界。
      一个男孩被怪兽打死，还有一个男孩为了保护另外两个男孩逃走，也被打死，只剩主人公和另一个男孩，他们决定要
      好好长大，变得强大，然后去给兄弟们报仇。由于他们所擅长的不同，主人公去了北方部落学习剑术和体术，而他的兄弟
      去了南方学习治疗和控制。
      不知不觉他们都成了二十几岁的小伙子，也练就了一身本领，这一年是兽族和人类的最后一场决战，此时两个人带领着各自的队伍
      在前线奋勇杀敌，而魔族的主力也在，他们两个人的队伍，不知不觉得就被魔兽大军给包围了，很快两个队伍的人就只剩下主人公和
      他的伙伴，而距离支援赶来还有一阵子，这个时候伙伴奋不顾身用尽浑身卸数来治疗自己和男主，后来实在是支撑不起两个人的
      治疗量，于是就只给男主来治疗，最后终于坚持到了支援的来临，而伙伴也实在是支撑不住了，最后也去世了。
      这场战斗最终获得了胜利，但是此时童年的玩伴也都不在了。春天他独自一人来到了南方，他的伙伴训练的地方，在训练场的外面看到了
      红豆长出来了，此时男主终于忍不住了，泪流满面。


      <br>
      三、相思了无益，悔当初相见。 <br>

      <br>
      四、落红不是无情物，化作春泥更护花。<br>

      <br>
      五、山有木兮木有枝，心悦君兮君不知。 <br>

      <br><br><br>
      <br><br><br>
      <br><br><br>
      <br><br><br>
      <br><br><br>
      <br><br><br>
      <br><br><br>
      <br><br><br>
      <br><br><br>
      <br><br><br>
      <br><br><br>
      <br><br><br>
      <br><br><br>
      <br><br><br>
      <br><br><br>
      <br><br><br>
      <br><br><br>
      <br><br><br>
      <br><br><br>
      <br><br><br>
      <br><br><br>
      <br><br><br>
      <br><br><br>


    </div>
    <el-backtop target=".page-component__scroll .el-scrollbar__wrap"></el-backtop>
  </div>

</template>

<script>
export default {
  name: "Story"
}
</script>

<style scoped>

</style>